{
  "Metadata": {
    "title": "page_meta"
  },
  "Manifest": {
    "name": "манифест приложения"
  },
  "Main": {
    "me": "Всем привет",
    "name": "Я Артём",

    "shortDescription": "Ведущий Fullstack разработчик. Люблю покумекать мозгами над чем-то сложным, о чём пишу научные статьи и программы на работе",
    "description": "Хочу представиться, я разработчик, за неимением лучшего слова - \"всего\", разрабатывал я всё что угодно душе. Программы на C++ как в качестве сервера, так и для высокопроизводительных вычислений. На Java, любимом языке я пишу backend, в практике делал самые сложные интеграции с древними SOAP системами. На Python я реализовал модель + backend для распознавания данных бух. отчётности, а чтоб совсем челюсть отвисла - завернул всё это дело в Triton Inference Server. На typescript я написал проект гибкой аналитики с использованием amcharts. **В общем, много чем был занят)), о чём ниже расскажу подробнее, элементы Стажа кликабельны и раскрываемы, как и названия компаний.**",

    "about": "О себе любимом",
    "experience": "Стаж",
    "educationSection": "Образование",
    "skills": "Навыки",
    "publicActivities": "Активность",
    "quickPublicActivitiesInfo": "(Желание + Возможность + Усилия) * Время = Достижение",

    "contact": "Контакты",
    "getInTouch": "В случае предложений",
    "contactDescription": "Открыт для общения на самые разные темы. Рассмотрю деловые предложения, предложения о научных исследованиях в тематике гидрогазодинамики, механики.",

    "workCompany1": "ООО \"Эльфин\"",
    "workLocation1": "Мск, гибрид",
    "workTitle1": "Ведущий разработчик процессных приложений",
    "workStart1": "Февраль 2024",
    "workEnd1": "н.в.",
    "workDescription1": "__**Обязанности**__  \nРазработка и поддержка серверной части приложений  \nПодготовка инструкций по запуску сервисов и написание документации  \nПоддержка платформы и расследование инцидентов  \nРазработка отказоустойчивых систем и Unit тестов (JUnit, Mockito)  \nПроектирование DMN и BPMN по требованиям аналитиков  \n\n__**Достижения**__  \nИнтеграция с внешними банковскими системами (SOAP, REST), НБКИ и ФНС  \nМасштабный рефакторинг: переписал ядро с Groovy на Kotlin  \nРазработка сервиса распознавания бухгалтерской отчётности (формы 1–6) с нуля  \nОбучение и оптимизация нейросети для Triton Inference Server — ускорение в 4 раза, повышение стабильности и пропускной способности  \nИнтеграция сервиса распознавания в существующую платформу  \n\n__**Технологии**__  \n**Backend:** Spring Boot (Data, Cloud, Security, MVC, WebFlux), Elasticsearch v5, PostgreSQL 11+, Java 11/15/17, Groovy, Kotlin, Keycloak, ELK, Kafka, Yarg  \n**AI Backend:** Python 3.10, Uv, Numba, OpenCV, Pypdfium, PyTorch 2.7.0, FastAPI + Triton Inference Server",

    "workCompany2": "ООО \"Каунсил Сервис\"",
    "workLocation2": "Мск, офис",
    "workTitle2": "Программист-разработчик",
    "workStart2": "Апрель 2022",
    "workEnd2": "Февраль 2024",
    "workDescription2": "__**Обязанности**__  \nПоддержка платформы RentRabbit и внедрение новых фич  \nРазработка библиотек и написание документации  \nАнализ и устранение инцидентов  \n\n__**Достижения**__  \nРазработка гибкой системы аналитики данных и построения графиков  \nСоздание механизма подготовки данных для графиков и Word-отчётов  \nИнтеграция системы аналитики в платформу — отчёты и визуализация под любые нужды  \nПоддержка системы ведения внешних обязательств арендодателей  \nУчастие в анализе решений и планировании сроков реализации  \n\n__**Технологии**__  \n**Backend:** Spring Boot (Data, Security, MVC), Elasticsearch v8, PostgreSQL 11+, Java 11/17, Keycloak, ELK, RabbitMQ, docx4j, Apache POI, JasperReports, JAXB  \n**Frontend:** TypeScript 4, amCharts 5, Ant Design v3",

    "educationSchool1": "НИУ МГСУ",
    "educationResult1": "степень Бакалавра",

    "educationSchool2": "IT Школа Samsung",
    "educationResult2": "Золотой диплом с отличием"
  }
}
